Repository: routersys/YMM4-HeatHaze
Catalog: Translate.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# CurrentCulture
source: en-us
ar_sa: ar-sa
es_es: es-es
id_id: id-id
ko_kr: ko-kr
zh_cn: zh-cn
zh_tw: zh-tw

# ControlMode_Automatic
source: Automatic
ar_sa: تلقائي
es_es: Automático
id_id: Otomatis
ko_kr: 자동
zh_cn: 自动
zh_tw: 自動

# ControlMode_Manual
source: Manual
ar_sa: يدوي
ko_kr: 수동
zh_cn: 手动
zh_tw: 手動

# DebugViewMode_Result
source: Result
ar_sa: النتيجة
es_es: Resultado
id_id: Hasil
ko_kr: 최종 결과
zh_cn: 最终结果
zh_tw: 最終結果

# DebugViewMode_NoiseView
source: Noise View
ar_sa: عرض الضوضاء
es_es: Vista de ruido
id_id: Tampilan Noise
ko_kr: 노이즈 보기
zh_cn: 噪声视图
zh_tw: 噪聲視圖

# GroupName_ControlMode
source: Control Mode
ar_sa: وضع التحكم
es_es: Modo de control
id_id: Mode Kontrol
ko_kr: 제어 모드
zh_cn: 操作模式
zh_tw: 操作模式

# Name_ControlMode
source: Mode Switch
ar_sa: تبديل الوضع
es_es: Cambio de modo
id_id: Ganti Mode
ko_kr: 모드 전환
zh_cn: 模式切换
zh_tw: 模式切換

# Description_ControlMode
source: Switches the control mode between intuitive "Automatic" and detailed "Manual".
ar_sa: يقوم بتبديل وضع التحكم بين "تلقائي" سهل الاستخدام و "يدوي" مفصل.
es_es: Cambia el modo de control entre el "Automático" intuitivo y el "Manual" detallado.
id_id: Beralih mode kontrol antara "Otomatis" yang intuitif dan "Manual" yang terperinci.
ko_kr: 직관적인 "자동" 모드와 상세한 "수동" 모드 간에 제어 모드를 전환합니다.
zh_cn: 在直观的“自动”和详细的“手动”之间切换控制模式。
zh_tw: 在直觀的“自動”和詳細的“手動”之間切換控制模式。

# GroupName_AutoSettings
source: Automatic Settings
ar_sa: الإعدادات التلقائية
es_es: Configuración automática
id_id: Pengaturan Otomatis
ko_kr: 자동 설정
zh_cn: 自动设定
zh_tw: 自動設定

# Name_Temperature
source: Temperature
ar_sa: درجة الحرارة
es_es: Temperatura
id_id: Suhu
ko_kr: 온도
zh_cn: 温度
zh_tw: 溫度

# Description_Temperature
source: Automatically adjusts the strength and speed of the shimmer by simulating real-world temperature.
ar_sa: يضبط تلقائيًا قوة وسرعة التلألؤ من خلال محاكاة درجة حرارة العالم الحقيقي.
es_es: Ajusta automáticamente la intensidad y la velocidad del brillo simulando la temperatura del mundo real.
id_id: Secara otomatis menyesuaikan kekuatan dan kecepatan kilau dengan mensimulasikan suhu dunia nyata.
ko_kr: 실제 온도를 시뮬레이션하여 반짝임의 강도와 속도를 자동으로 조정합니다.
zh_cn: 通过模拟真实世界的温度，自动调整闪烁的强度和速度。
zh_tw: 通過模擬真實世界的溫度，自動調整閃爍的強度和速度。

# Name_Humidity
source: Humidity
ar_sa: الرطوبة
es_es: Humedad
id_id: Kelembaban
ko_kr: 습도
zh_cn: 湿度
zh_tw: 濕度

# Description_Humidity
source: Adjusts the texture of the shimmer by simulating real-world humidity.
ar_sa: يضبط نسيج التلألؤ من خلال محاكاة رطوبة العالم الحقيقي.
es_es: Ajusta la textura del brillo simulando la humedad del mundo real.
id_id: Menyesuaikan tekstur kilau dengan mensimulasikan kelembapan dunia nyata.
ko_kr: 실제 습도를 시뮬레이션하여 반짝임의 질감을 조정합니다.
zh_cn: 通过模拟真实世界的湿度来调整闪光的纹理。
zh_tw: 通過模擬真實世界的濕度來調整閃光的紋理。

# GroupName_ManualSettings
source: Manual Settings
ar_sa: الإعدادات اليدوية
es_es: Configuración manual
id_id: Pengaturan Manual
ko_kr: 수동 설정
zh_cn: 手动设定
zh_tw: 手動設定

# Name_Strength
source: Strength
ar_sa: القوة
es_es: Fuerza
id_id: Kekuatan
ko_kr: 강도
zh_cn: 强度
zh_tw: 強度

# Description_Strength
source: Adjusts the amount of image distortion.
ar_sa: يضبط مقدار تشويه الصورة.
es_es: Ajusta la cantidad de distorsión de la imagen.
id_id: Menyesuaikan jumlah distorsi gambar.
ko_kr: 이미지 왜곡의 양을 조정합니다.
zh_cn: 调整图像失真的程度。
zh_tw: 調整圖像失真的程度。

# Name_Scale
source: Scale
ar_sa: الحجم
es_es: Escala
id_id: Skala
ko_kr: 스케일
zh_cn: 尺度
zh_tw: 尺度

# Description_Scale
source: Adjusts the size of the distortion pattern.
ar_sa: يضبط حجم نمط التشويه.
es_es: Ajusta el tamaño del patrón de distorsión.
id_id: Menyesuaikan ukuran pola distorsi.
ko_kr: 왜곡 패턴의 크기를 조정합니다.
zh_cn: 调整失真图案的大小。
zh_tw: 調整失真圖案的大小。

# Name_FlowSpeed
source: Flow Speed
ar_sa: سرعة التدفق
es_es: Velocidad de flujo
id_id: Kecepatan Aliran
ko_kr: 흐름 속도
zh_cn: 流速
zh_tw: 流速

# Description_FlowSpeed
source: Controls the speed at which the entire distortion pattern moves.
ar_sa: يتحكم في سرعة تحرك نمط التشويه بأكمله.
es_es: Controla la velocidad a la que se mueve todo el patrón de distorsión.
id_id: Mengontrol kecepatan pergerakan seluruh pola distorsi.
ko_kr: 전체 왜곡 패턴이 이동하는 속도를 제어합니다.
zh_cn: 控制整个失真图案的移动速度。
zh_tw: 控制整個失真圖案的移動速度。

# Name_BoilSpeed
source: Boil Speed
ar_sa: سرعة الغليان
es_es: Velocidad de ebullición
id_id: Kecepatan Mendidih
ko_kr: 끓는 속도
zh_cn: 沸腾速度
zh_tw: 沸騰速度

# Description_BoilSpeed
source: Controls the speed at which the distortion pattern changes in place.
ar_sa: يتحكم في سرعة تغير نمط التشويه في مكانه.
es_es: Controla la velocidad a la que el patrón de distorsión cambia en su lugar.
id_id: Mengontrol kecepatan perubahan pola distorsi di tempat.
ko_kr: 왜곡 패턴이 제자리에서 변경되는 속도를 제어합니다.
zh_cn: 控制失真图案就地变化的速度。
zh_tw: 控制失真圖案就地變化的速度。

# GroupName_CommonSettings
source: Common Settings
ar_sa: الإعدادات العامة
es_es: Configuración común
id_id: Pengaturan Umum
ko_kr: 공통 설정
zh_cn: 共通设定
zh_tw: 共通設定

# Name_Angle
source: Angle
ar_sa: الزاوية
es_es: Ángulo
id_id: Sudut
ko_kr: 각도
zh_cn: 角度
zh_tw: 角度

# Description_Angle
source: Adjusts the direction in which the distortion occurs.
ar_sa: يضبط اتجاه حدوث التشويه.
es_es: Ajusta la dirección en la que se produce la distorsión.
id_id: Menyesuaikan arah terjadinya distorsi.
ko_kr: 왜곡이 발생하는 방향을 조정합니다.
zh_cn: 调整失真发生的方向。
zh_tw: 調整失真發生的方向。

# Name_ChromaticAberration
source: Chromatic Aberration
ar_sa: انحراف لوني
es_es: Aberración cromática
id_id: Aberasi Kromatik
ko_kr: 색수차
zh_cn: 色差
zh_tw: 色差

# Description_ChromaticAberration
source: Adjusts the strength of the RGB color shift that accompanies the distortion.
ar_sa: يضبط قوة إزاحة لون RGB المصاحبة للتشويه.
es_es: Ajusta la intensidad del cambio de color RGB que acompaña a la distorsión.
id_id: Menyesuaikan kekuatan pergeseran warna RGB yang menyertai distorsi.
ko_kr: 왜곡에 수반되는 RGB 색상 변화의 강도를 조정합니다.
zh_cn: 调整伴随失真的 RGB颜色偏移的强度。
zh_tw: 調整伴隨失真的 RGB顏色偏移的強度。

# Name_EnableBlur
source: Linked Blur
ar_sa: تمويه مرتبط
es_es: Desenfoque vinculado
id_id: Blur Tertaut
ko_kr: 연동 블러
zh_cn: 联动模糊
zh_tw: 聯動模糊

# Description_EnableBlur
source: When turned on
ar_sa: Cuando se activa
es_es: 켜면 왜곡의 강도에 따라 이미지가 약간 흐려집니다.
id_id: la imagen se desenfoca ligeramente según la intensidad de la distorsión.
ko_kr: 開啟後，圖像會根據失真強度略微模糊。
zh_cn: the image blurs slightly according to the strength of the distortion.
zh_tw: 开启后，图像会根据失真强度略微模糊。

# Name_BlurStrength
source: Blur Strength
ar_sa: قوة التمويه
es_es: Fuerza de desenfoque
id_id: Kekuatan Buram
ko_kr: 블러 강도
zh_cn: 模糊强度
zh_tw: 模糊強度

# Description_BlurStrength
source: Adjusts the strength of the blur linked to the distortion.
ar_sa: يضبط قوة التمويه المرتبط بالتشويه.
es_es: Ajusta la intensidad del desenfoque vinculado a la distorsión.
id_id: Menyesuaikan kekuatan blur yang terkait dengan distorsi.
ko_kr: 왜곡과 관련된 블러의 강도를 조정합니다.
zh_cn: 调整与失真相关的模糊强度。
zh_tw: 調整與失真相關的模糊強度。

# Name_PreventEdgeStretch
source: Prevent Edge Stretch
ar_sa: منع تمدد الحواف
es_es: Evitar estiramiento de bordes
id_id: Cegah Peregangan Tepi
ko_kr: 가장자리 늘어남 방지
zh_cn: 防止边缘拉伸
zh_tw: 防止邊緣拉伸

# Description_PreventEdgeStretch
source: When turned on
ar_sa: Cuando se activa
es_es: 켜면 왜곡으로 인해 이미지 가장자리가 늘어나는 것을 방지합니다.
id_id: evita que los bordes de la imagen se estiren por la distorsión.
ko_kr: 開啟後，可以防止圖像邊緣因失真而被拉伸。
zh_cn: it prevents the edges of the image from being stretched by the distortion.
zh_tw: 开启后，可以防止图像边缘因失真而被拉伸。

# GroupName_Debug
source: Debug
ar_sa: تصحيح الأخطاء
es_es: Depuración
ko_kr: 디버그
zh_cn: 调试
zh_tw: 調試

# Name_DebugMode
source: Display Mode
ar_sa: وضع العرض
es_es: Modo de visualización
id_id: Mode Tampilan
ko_kr: 표시 모드
zh_cn: 显示模式
zh_tw: 顯示模式

# Description_DebugMode
source: For debugging purposes
ar_sa: Para fines de depuración
es_es: 디버깅을 위해 내부적으로 생성된 노이즈 패턴을 표시합니다.
id_id: muestra el patrón de ruido generado internamente.
ko_kr: 出於調試目的，顯示內部生成的噪聲模式。
zh_cn: displays the internally generated noise pattern.
zh_tw: 出于调试目的，显示内部生成的噪声模式。

# EffectName
source: Heat Shimmer
ar_sa: تلألؤ حراري
es_es: Bruma de calor
id_id: Kilau Panas
ko_kr: 아지랑이
zh_cn: 热浪
zh_tw: 熱浪
